
area_to_code={
'云南省':'530000',   '昆明市': '530100',      '昭通市': '530600',
'曲靖市': '530300',  '玉溪市': '530400',      '普洱市': '530800',
'保山市': '530500',  '楚雄州': '532300',      '丽江市': '530700',
'红河州': '532500',  '西双版纳州': '532800',   '临沧市': '530900',
'大理州': '532900',  '德宏州': '533100',      '文山州': '532600',
'怒江州': '533300',  '迪庆州': '533400',
}

code_to_area = dict()
for area, code in area_to_code.items():
    code_to_area[code] = area


if __name__ == '__main__':
    print(area_to_code)
    print(code_to_area)